src/InformationRegisters/ИС_Ламода_СоответствиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ламода_СоответствиеТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерЛамода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ОграничениеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ОграничениеОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_РучныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_РучныеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ПоследниеВыгруженныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ПоследниеВыгруженныеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_МП_РучныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_МП_РучныеЦены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_ВидыЦенМаркетплейса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_МП_ПоследниеВыгруженныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_МП_ПоследниеВыгруженныеЦены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_ВидыЦенМаркетплейса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_МП_ВидыЦенМаркетплейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_ВидыЦенМаркетплейса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидЦены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидЦеныСоСкидкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидЦеныМинимальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_Ламода_Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ламода_Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяГруппаСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиИзГруппыСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппаСкладов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаправленияДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИС_Ламода_Сервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура ПолучитьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияЛамода Тогда
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, МассивНастроек);

	СтруктураПараметров = Новый Структура;

	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить("Ламода" + Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(Форма, СтруктураПараметров);
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("AccessTokenB2B");
	МассивНастроек.Добавить("AccessTokenSeller");
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, МассивНастроек, "Строка");
		
	Форма.ЛамодаAccessTokenB2B    = СтруктураНастроек.AccessTokenB2B;
	Форма.ЛамодаAccessTokenSeller = СтруктураНастроек.AccessTokenSeller;
		
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура ЗаписатьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияЛамода Тогда
		Возврат;
	КонецЕсли;
	
	МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = МассивНастроекЗаполненияДокументов(МассивНастроек);
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из МассивНастроек Цикл
		
		Если Элемент = "AccessTokenB2B" 
			Или Элемент = "AccessTokenSeller" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтруктураНастроек.Вставить("Ламода" + Элемент, Неопределено);
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Форма);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить(СтрЗаменить(Элемент.Ключ, "Ламода", ""), Элемент.Значение);	
	КонецЦикла;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("AccessTokenB2B",    Форма.ЛамодаAccessTokenB2B);
	СтруктураПараметров.Вставить("AccessTokenSeller", Форма.ЛамодаAccessTokenSeller);
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров, "Строка");
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция МассивНастроекПодключения(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("АдресСервисаB2B");
	МассивНастроек.Добавить("АдресСервисаSeller");
	МассивНастроек.Добавить("ПортB2B");
	МассивНастроек.Добавить("ПортSeller");
	МассивНастроек.Добавить("HTTPSB2B");
	МассивНастроек.Добавить("HTTPSSeller");
	МассивНастроек.Добавить("ClientId");
	МассивНастроек.Добавить("ClientSecret");
	МассивНастроек.Добавить("AccessTokenB2B");
	МассивНастроек.Добавить("AccessTokenB2BИстекает");
	МассивНастроек.Добавить("AccessTokenSeller");
	МассивНастроек.Добавить("AccessTokenSellerИстекает");
		
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120 

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция МассивНастроекЗаполненияДокументов(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("Партнер");
	МассивНастроек.Добавить("Контрагент");	
	МассивНастроек.Добавить("Соглашение");
	МассивНастроек.Добавить("Договор");
	МассивНастроек.Добавить("Подразделение");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция МассивНастроекОстатков(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("ВыгружатьОстаткиВРазрезеОрганизации");
	МассивНастроек.Добавить("ИспользоватьПоследниеОстатки");	
	МассивНастроек.Добавить("ИспользоватьФиксированныйОстаток");
	МассивНастроек.Добавить("ФиксированныйОстаток");
	МассивНастроек.Добавить("РежимСокрытияОстатков");
	МассивНастроек.Добавить("СкрываемыйОстаток");
	МассивНастроек.Добавить("РассчитыватьНесобранныеКомплекты");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция МассивНастроекЦен(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("ВидЦены");
	МассивНастроек.Добавить("ВидЦеныСоСкидкой");
	МассивНастроек.Добавить("РежимОкругленияЦен");
	МассивНастроек.Добавить("ИспользоватьПоследниеЦены");
		
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
#КонецОбласти

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ТестПодключения(Профиль, Параметры) Экспорт
	
	ТекстРезультат = "";
	
	ТекстРезультат = ТекстРезультат + ВыполнитьТестПодключенияB2B(Профиль, Параметры) + Символы.ПС;
	
	ТекстРезультат = ТекстРезультат + ВыполнитьТестПодключенияSeller(Профиль, Параметры) + Символы.ПС;
	
	Возврат ТекстРезультат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ВыполнитьТестПодключенияB2B(Профиль, Параметры) Экспорт
	
	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
	
	ПараметрыЗапроса.Сервер               = Параметры.АдресСервисаB2B;
	ПараметрыЗапроса.Порт                 = Параметры.ПортB2B;
	ПараметрыЗапроса.ЗащищенноеСоединение = Параметры.HTTPSB2B;
	
	РезультатЗапроса = ПолучитьТокенB2B(Профиль, ПараметрыЗапроса, Параметры);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат "Тест подключения API B2B завершился с ошибкой";
	КонецЕсли;
	
	Возврат "Тест подключения API B2B выполнен успешно";
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ВыполнитьТестПодключенияSeller(Профиль, Параметры) Экспорт
	
	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
	
	ПараметрыЗапроса.Сервер               = Параметры.АдресСервисаSeller;
	ПараметрыЗапроса.Порт                 = Параметры.ПортSeller;
	ПараметрыЗапроса.ЗащищенноеСоединение = Параметры.HTTPSSeller;
	
	РезультатЗапроса = ПолучитьТокенSeller(Профиль, ПараметрыЗапроса, Параметры);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат "Тест подключения API Lamoda Seller завершился с ошибкой";
	КонецЕсли;
	
	Возврат "Тест подключения API Lamoda Seller выполнен успешно";
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьТокенB2B(Профиль, ПараметрыЗапроса, Параметры) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("client_id",     Параметры.ClientId);
	СтруктураПараметров.Вставить("client_secret", Параметры.ClientSecret);
	СтруктураПараметров.Вставить("grant_type",    "client_credentials");
	
	РезультатЗапроса = ИС_Ламода_АПИ.ПолучитьТокенB2B(Профиль, ПараметрыЗапроса, СтруктураПараметров);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("AccessTokenB2BИстекает", ТекущаяДатаСеанса() + Число(РезультатЗапроса.expires_in));
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Профиль, Маркетплейс, СтруктураПараметров); 
	
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("AccessTokenB2B", РезультатЗапроса.access_token);

	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Профиль, Маркетплейс, СтруктураПараметров, "Строка");
	
	Возврат РезультатЗапроса.access_token;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьТокенSeller(Профиль, ПараметрыЗапроса, Параметры) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("client_id",     Параметры.ClientId);
	СтруктураПараметров.Вставить("client_secret", Параметры.ClientSecret);
	СтруктураПараметров.Вставить("grant_type",    "client_credentials");
	
	РезультатЗапроса = ИС_Ламода_АПИ.ПолучитьТокенSeller(Профиль, ПараметрыЗапроса, СтруктураПараметров);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("AccessTokenSellerИстекает", ТекущаяДатаСеанса() + Число(РезультатЗапроса.expires_in));
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Профиль, Маркетплейс, СтруктураПараметров); 
	
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("AccessTokenSeller", РезультатЗапроса.access_token);

	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Профиль, Маркетплейс, СтруктураПараметров, "Строка");
	
	Возврат РезультатЗапроса.access_token;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура ВыполнитьКомандуРеглЗадания(Профиль, ИдентификаторКомандыОбработки) Экспорт

	Событие = ИмяСобытия("ВыполнитьКомандуРеглЗадания");
	 
	Если ИдентификаторКомандыОбработки = "ВыгрузкаОстатковЛамода" Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_Ламода_Склады.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ИС_Ламода_Склады КАК ИС_Ламода_Склады
			|ГДЕ
			|	НЕ ИС_Ламода_Склады.ПометкаУдаления
			|	И ИС_Ламода_Склады.Профиль = &Профиль
			|	И НЕ(ИС_Ламода_Склады.ОбщаяГруппаСкладов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|				И ИС_Ламода_Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|				И НЕ ИС_Ламода_Склады.ВыгружатьОстаткиИзГруппыСкладов)";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ВыгрузитьОстатки(Профиль, Выборка.Ссылка);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#Область РаботаСТоварами

#Область КарточкиТоваров

//+ ИнфоСофт Ивонин К.А. 03.03.25 УА #92887
Функция КоличествоТоваров(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Справочник.ИС_Ламода_Номенклатура КАК ИС_Ламода_Номенклатура
	|ГДЕ
	|	ИС_Ламода_Номенклатура.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКоличества = РезультатЗапроса.Выбрать();
	
	Если ВыборкаКоличества.Следующий() Тогда
		Возврат ВыборкаКоличества.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.03.25 УА #92887

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ОбработатьДопПараметрыЗагрузкиТоваров(ДопПараметры) Экспорт
	
	Возврат ДопПараметры;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120	
	
//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьКарточкиТоваров(Профиль, Перезаполнять = Ложь, ДопПараметры = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка карточек товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ПараметрыHTTPЗапросаSeller(Профиль);
	
	КоличествоТоваров = 0;
	КоличествоСтраниц = 0;
	
	КоличествоЭлементовНаЗапрос = 100;
	КоличествоПопытокЗапроса    = 10;
	КоличествоОшибок            = 0;
	Обработано                  = 0;
	ТекущаяСтраница             = 1;
	
	ПервыйЗапрос = Истина;
	
	СтруктураПараметров = ИС_Ламода_АПИ.СтруктураПараметровЗапросаСпискаНоменклатуры(КоличествоЭлементовНаЗапрос);
	
	МассивSKU = Новый Массив;
	
	СоответствиеТоваровДляЗагрузки = Новый Соответствие;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ДатаОбновления", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("lamoda_sku", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	
	Пока Истина Цикл	                                         
		
		Если Не ПервыйЗапрос И ТекущаяСтраница > КоличествоСтраниц Тогда
			Прервать;
		КонецЕсли;
		
		ТаблицаДанных.Очистить();    
		СоответствиеТоваровДляЗагрузки.Очистить();
		
		Если КоличествоОшибок >= КоличествоПопытокЗапроса Тогда
			ВызватьИсключение("Превышено количество ошибок при запросах к API");
		КонецЕсли;
		
		СтруктураПараметров.page = ТекущаяСтраница;
		
		Результат = ИС_Ламода_АПИ.ПолучитьНоменклатуру(Профиль, ПараметрыЗапроса, СтруктураПараметров); 
		
		Если Результат = Неопределено Или Результат.Свойство("nomenclatures") = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
		
		МассивНоменклатуры = Результат["nomenclatures"];
		
		Если МассивНоменклатуры.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого Элемент Из МассивНоменклатуры Цикл
		
			НоваяСтрока = ТаблицаДанных.Добавить();
			
			НоваяСтрока.lamoda_sku = Элемент["lamoda_sku"];
			НоваяСтрока.ДатаОбновления = ?(Перезаполнять, ТекущаяДатаСеанса(), 
				ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Элемент["updated_at"], ФорматДатыJSON.ISO));
				
			МассивSKU.Добавить(Элемент["lamoda_sku"]);	
				
			СоответствиеТоваровДляЗагрузки.Вставить(Элемент["lamoda_sku"], Элемент);
		
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЧ.ДатаОбновления КАК ДатаОбновления,
			|	ТЧ.lamoda_sku КАК lamoda_sku
			|ПОМЕСТИТЬ ВТ_lamoda_sku
			|ИЗ
			|	&ТЧ КАК ТЧ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	isNULL(ИС_Ламода_РазмерыНоменклатуры.updated_at, ДатаВремя(3999, 12, 31, 23, 59, 59)) КАК ДатаПоследнегоИзменения,
			|	ВТ_lamoda_sku.ДатаОбновления КАК ДатаОбновления,
			|	ВТ_lamoda_sku.lamoda_sku КАК lamoda_sku,
			|	ИС_Ламода_РазмерыНоменклатуры.Ссылка КАК РазмерЛамода,
			|	ИС_Ламода_РазмерыНоменклатуры.Владелец КАК НоменклатураЛамода
			|ПОМЕСТИТЬ ВТ_Номенклатура
			|ИЗ
			|	ВТ_lamoda_sku КАК ВТ_lamoda_sku
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ламода_РазмерыНоменклатуры КАК ИС_Ламода_РазмерыНоменклатуры
			|		ПО ВТ_lamoda_sku.lamoda_sku = ИС_Ламода_РазмерыНоменклатуры.Код
			|			И (ИС_Ламода_РазмерыНоменклатуры.Профиль = &Профиль)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Номенклатура.lamoda_sku КАК lamoda_sku,
			|	ЗНАЧЕНИЕ(Справочник.ИС_Ламода_РазмерыНоменклатуры.ПустаяСсылка) КАК РазмерЛамода,
			|	ЗНАЧЕНИЕ(Справочник.ИС_Ламода_Номенклатура.ПустаяСсылка) КАК НоменклатураЛамода
			|ИЗ
			|	ВТ_Номенклатура КАК ВТ_Номенклатура
			|ГДЕ
			|	ВТ_Номенклатура.РазмерЛамода ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ВТ_Номенклатура.lamoda_sku,
			|	ЕСТЬNULL(ВТ_Номенклатура.РазмерЛамода, ЗНАЧЕНИЕ(Справочник.ИС_Ламода_РазмерыНоменклатуры.ПустаяСсылка)),
			|	ЕСТЬNULL(ВТ_Номенклатура.НоменклатураЛамода, ЗНАЧЕНИЕ(Справочник.ИС_Ламода_Номенклатура.ПустаяСсылка))
			|ИЗ
			|	ВТ_Номенклатура КАК ВТ_Номенклатура
			|ГДЕ
			|	ВТ_Номенклатура.ДатаОбновления > ВТ_Номенклатура.ДатаПоследнегоИзменения";
		
		Запрос.УстановитьПараметр("ТЧ",      ТаблицаДанных);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДопПараметрыНоменклатуры = Новый Структура;
			ДопПараметрыНоменклатуры.Вставить("РазмерЛамода",       Выборка.РазмерЛамода);
			ДопПараметрыНоменклатуры.Вставить("НоменклатураЛамода", Выборка.НоменклатураЛамода);
			
			СоздатьОбновитьНоменклатуру(Профиль, СоответствиеТоваровДляЗагрузки[Выборка.lamoda_sku], Перезаполнять, ДопПараметрыНоменклатуры);
				
			Обработано = Обработано + 1;	
				
		КонецЦикла;
		
		Если ПервыйЗапрос Тогда
			
			КоличествоТоваров = Результат["total"];
			КоличествоСтраниц = Результат["pages"];
			
			ПервыйЗапрос = Ложь;
			
		КонецЕсли;
		
		ДлительныеОперации.СообщитьПрогресс( , "Обработано " + Обработано + " из " + КоличествоТоваров + " карточек товаров");
		
		Если КоличествоЭлементовНаЗапрос > КоличествоТоваров Тогда
			Прервать;
		КонецЕсли;
		
		ТекущаяСтраница = ТекущаяСтраница + 1;
		
	КонецЦикла;
	
	Возврат "Загрузка завершена. Всего загружено " + Обработано + " элементов";
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция СоздатьОбновитьНоменклатуру(Профиль, Данные, Перезаполнять = Ложь, ДопПараметры = Неопределено) Экспорт
	
	Событие = ИмяСобытия("СоздатьОбновитьНоменклатуруLamoda");
	
	НоменклатураЛамода = Неопределено;
	РазмерЛамода       = Неопределено;
	
	Если Не ДопПараметры = Неопределено 
		И ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		
		Если ДопПараметры.Свойство("НоменклатураЛамода")
			И Не ДопПараметры.НоменклатураЛамода = Справочники.ИС_Ламода_Номенклатура.ПустаяСсылка() Тогда
		
			НоменклатураЛамода = ДопПараметры.НоменклатураЛамода.ПолучитьОбъект();
		
		КонецЕсли;
		
		Если ДопПараметры.Свойство("РазмерЛамода")
			И Не ДопПараметры.РазмерЛамода = Справочники.ИС_Ламода_РазмерыНоменклатуры.ПустаяСсылка() Тогда
		
			РазмерЛамода = ДопПараметры.РазмерЛамода.ПолучитьОбъект();
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если НоменклатураЛамода = Неопределено Тогда
		НоменклатураЛамода = Справочники.ИС_Ламода_Номенклатура.СоздатьЭлемент();
	КонецЕсли;
	
	НоменклатураЛамода.Профиль      = Профиль;
	НоменклатураЛамода.Код          = Данные["lamoda_parent_sku"];
	НоменклатураЛамода.seller_sku   = Данные["seller_parent_sku"];
	НоменклатураЛамода.brand        = Данные["brand"];
	НоменклатураЛамода.Наименование = Данные["name"];
	
	Попытка
		НоменклатураЛамода.Записать();
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Если РазмерЛамода = Неопределено Тогда
		РазмерЛамода = Справочники.ИС_Ламода_РазмерыНоменклатуры.СоздатьЭлемент();
	КонецЕсли;
	
	РазмерЛамода.Профиль      = Профиль;
	РазмерЛамода.Владелец     = НоменклатураЛамода.Ссылка;
	РазмерЛамода.Код          = Данные["lamoda_sku"];
	РазмерЛамода.Наименование = СтрШаблон("%1 %2", Данные["name"], Данные["seller_size"]);
	РазмерЛамода.seller_sku   = Данные["seller_sku"];
	РазмерЛамода.seller_size  = Данные["seller_size"];
	РазмерЛамода.barcode      = Данные["barcode"];
	РазмерЛамода.updated_at   = ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Данные["updated_at"], ФорматДатыJSON.ISO);
	
	Попытка
		РазмерЛамода.Записать();
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат РазмерЛамода.Ссылка;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область СопоставлениеТоваров

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ТекстЗапросаСопоставления() Экспорт

	Текст =
		"ВЫБРАТЬ
		|	ИС_Ламода_РазмерыНоменклатуры.Ссылка КАК РазмерЛамода,
		|	ИС_Ламода_РазмерыНоменклатуры.Владелец КАК НоменклатураЛамода,
		|	ИС_Ламода_РазмерыНоменклатуры.Код КАК LamodaSKU,
		|	ИС_Ламода_РазмерыНоменклатуры.barcode КАК ШтрихкодЛамода,
		|	ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ИС_Ламода_СоответствиеТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ИЛИ ИС_Ламода_СоответствиеТоваров.Упаковка ЕСТЬ NULL
		|			ТОГДА ИС_Ламода_СоответствиеТоваров.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ИС_Ламода_СоответствиеТоваров.Упаковка
		|	КОНЕЦ КАК Упаковка
		|ИЗ
		|	Справочник.ИС_Ламода_РазмерыНоменклатуры КАК ИС_Ламода_РазмерыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ламода_СоответствиеТоваров КАК ИС_Ламода_СоответствиеТоваров
		|		ПО (ИС_Ламода_СоответствиеТоваров.Профиль = &Профиль)
		|			И ИС_Ламода_РазмерыНоменклатуры.Ссылка = ИС_Ламода_СоответствиеТоваров.РазмерЛамода
		|ГДЕ
		|	ИС_Ламода_РазмерыНоменклатуры.Профиль = &Профиль
		|	И НЕ ИС_Ламода_РазмерыНоменклатуры.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НоменклатураЛамода";  
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ДобавитьСоответствиеТовара(Профиль, РазмерЛамода, Номенклатура, Характеристика, Упаковка, 
		ТекНоменклатура = Неопределено, ТекХарактеристика = Неопределено) Экспорт
		
	НаборЗаписей = РегистрыСведений.ИС_Ламода_СоответствиеТоваров.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Профиль.Установить(Профиль);
	НаборЗаписей.Отбор.РазмерЛамода.Установить(РазмерЛамода);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.Номенклатура = ТекНоменклатура И Запись.Характеристика = ТекХарактеристика Тогда
			
				Запись.Номенклатура   = Номенклатура;
				Запись.Характеристика = Характеристика;
				Запись.Упаковка       = Упаковка;
        		ТребуетсяНоваяЗапись  = Ложь;
        		Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Профиль        = Профиль; 
		НоваяЗапись.РазмерЛамода   = РазмерЛамода;
		НоваяЗапись.Номенклатура   = Номенклатура; 
		НоваяЗапись.Характеристика = Характеристика;
		НоваяЗапись.Упаковка       = Упаковка;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#КонецОбласти

#Область Остатки

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолеСопоставленияОстатков() Экспорт
	
	Возврат "РазмерЛамода";
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ТекстЗапросаОстатков() Экспорт
	
	Текст =
		"ВЫБРАТЬ
		|	ИС_Ламода_РазмерыНоменклатуры.Ссылка КАК ПолеСопоставления,
		|	ИС_Ламода_РазмерыНоменклатуры.Владелец КАК НоменклатураЛамода,
		|	ИС_Ламода_РазмерыНоменклатуры.Код КАК LamodaSKU,
		|	ИС_Ламода_РазмерыНоменклатуры.seller_sku КАК SellerSKU,
		|	ИС_Ламода_СоответствиеТоваров.Номенклатура КАК Номенклатура,
		|	ИС_Ламода_СоответствиеТоваров.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Упаковка, &ПустаяУпаковка) КАК Упаковка,
		|	НЕ ИС_Ламода_СоответствиеТоваров.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
		|	ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
		|	ВЫБОР
		|		КОГДА ИС_Ламода_СоответствиеТоваров.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ИС_Ламода_СоответствиеТоваров.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковки
		|ПОМЕСТИТЬ ВТ_Сопоставление
		|ИЗ
		|	Справочник.ИС_Ламода_РазмерыНоменклатуры КАК ИС_Ламода_РазмерыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ламода_СоответствиеТоваров КАК ИС_Ламода_СоответствиеТоваров
		|		ПО (ИС_Ламода_СоответствиеТоваров.Профиль = &Профиль)
		|			И (ИС_Ламода_СоответствиеТоваров.РазмерЛамода = ИС_Ламода_РазмерыНоменклатуры.Ссылка)
		|ГДЕ
		|	ИС_Ламода_РазмерыНоменклатуры.Профиль = &Профиль
		|	И НЕ ИС_Ламода_РазмерыНоменклатуры.ПометкаУдаления";
		
	Текст = Текст + ";";
			
	Текст = Текст + ИС_МП_УправлениеОстатками.ТекстЗапросаОстатков();
		
	Текст = Текст +
		"ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК РазмерЛамода,
		|	ВТ_Сопоставление.НоменклатураЛамода КАК НоменклатураЛамода,
		|	ВТ_Сопоставление.LamodaSKU КАК LamodaSKU,
		|	ВТ_Сопоставление.SellerSKU КАК SellerSKU,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВТ_Остатки.Свободно КАК Свободно,
		|	ВТ_Остатки.Резерв КАК Резерв,
		|	ВЫБОР
		|		КОГДА ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL
		|			ТОГДА &КоличествоСкрываемогоОстатка
		|		ИНАЧЕ ИС_MP_ОграничениеОстатков.Остаток
		|	КОНЕЦ КАК СкрываемыйОстаток,
		|	НЕ ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL КАК ЕстьСкрываемыйОстаток,
		|	ИС_MP_РучныеОстатки.Остаток КАК РучнойОстаток,
		|	НЕ ИС_MP_РучныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьРучнойОстаток,
		|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
		|	ЕСТЬNULL(ИС_MP_ПоследниеВыгруженныеОстатки.Остаток, 0) КАК ПоследнийВыгруженныйОстаток,
		|	НЕ ИС_MP_ПоследниеВыгруженныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьПоследнийВыгруженныйОстаток
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|			ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Остатки.ПолеСопоставления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ОграничениеОстатков КАК ИС_MP_ОграничениеОстатков
		|		ПО (ИС_MP_ОграничениеОстатков.Профиль = &Профиль)
		|			И (ИС_MP_ОграничениеОстатков.Маркетплейс = &Маркетплейс)
		|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.КарточкаМП КАК Справочник.ИС_Ламода_РазмерыНоменклатуры)) = ВТ_Сопоставление.ПолеСопоставления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_РучныеОстатки КАК ИС_MP_РучныеОстатки
		|		ПО (ИС_MP_РучныеОстатки.Профиль = &Профиль)
		|			И (ИС_MP_РучныеОстатки.Маркетплейс = &Маркетплейс)
		|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.КарточкаМП КАК Справочник.ИС_Ламода_РазмерыНоменклатуры)) = ВТ_Сопоставление.ПолеСопоставления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ПоследниеВыгруженныеОстатки КАК ИС_MP_ПоследниеВыгруженныеОстатки
		|		ПО (ИС_MP_ПоследниеВыгруженныеОстатки.Профиль = &Профиль)
		|			И (ИС_MP_ПоследниеВыгруженныеОстатки.Маркетплейс = &Маркетплейс)
		|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.КарточкаМП КАК Справочник.ИС_Ламода_РазмерыНоменклатуры)) = ВТ_Сопоставление.ПолеСопоставления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ";
	
	Возврат Текст;		
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ИнформацияОСкладе(Склад) Экспорт

	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ламода_Склады.Ссылка КАК Ссылка,
		|	ИС_Ламода_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
		|	ИС_Ламода_Склады.Склад КАК Склад,
		|	ИС_Ламода_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
		|	ИС_Ламода_СкладыГруппаСкладов.Склад КАК СкладГруппы
		|ИЗ
		|	Справочник.ИС_Ламода_Склады КАК ИС_Ламода_Склады
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ламода_Склады.ГруппаСкладов КАК ИС_Ламода_СкладыГруппаСкладов
		|		ПО ИС_Ламода_Склады.Ссылка = ИС_Ламода_СкладыГруппаСкладов.Ссылка
		|ГДЕ
		|	ИС_Ламода_Склады.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Ссылка";
	
	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = "";
		
	Пока ВыборкаСклад.Следующий() Цикл				
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    Результат = Результат + "Группа складов: " + Символы.ПС;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	Результат = Результат + Символы.Таб + " - " + ВыборкаГруппаСкладов.СкладГруппы + Символы.ПС;
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Результат = Результат + "Общая группа складов: " + ВыборкаСклад.ОбщаяГруппаСкладов + Символы.ПС;
		Иначе
			Результат = Результат + "Склад: " + ВыборкаСклад.Склад + Символы.ПС;		
		КонецЕсли;
	
	КонецЦикла;
    
    Возврат Результат;

КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт
	
	Событие = ИмяСобытия("УстановитьПараметрыЗапросаОстатковЛамода");
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	Настройки = ИС_Ламода_СерверПовтИсп.НастройкиОстатков(Профиль);
	
	СкрываемыйОстаток                   = 0;
	РассчитыватьНесобранныеКомплекты    = Ложь;
	ВыгружатьОстаткиВРазрезеОрганизации = Ложь;
	                    
	Если Настройки.СкрываемыйОстаток <> Неопределено Тогда
		СкрываемыйОстаток = Настройки.СкрываемыйОстаток;       
	КонецЕсли;
	
	Если Настройки.РассчитыватьНесобранныеКомплекты <> Неопределено Тогда
		РассчитыватьНесобранныеКомплекты = Настройки.РассчитыватьНесобранныеКомплекты;       
	КонецЕсли;
	
	Если Настройки.ВыгружатьОстаткиВРазрезеОрганизации <> Неопределено Тогда
		ВыгружатьОстаткиВРазрезеОрганизации = Настройки.ВыгружатьОстаткиВРазрезеОрганизации;       
	КонецЕсли;
			
	Запрос.УстановитьПараметр("Профиль", 							 Профиль);
	Запрос.УстановитьПараметр("Маркетплейс", 						 Маркетплейс);
	Запрос.УстановитьПараметр("Склад", 								 Склад); 
	Запрос.УстановитьПараметр("КоличествоСкрываемогоОстатка",        СкрываемыйОстаток);
	Запрос.УстановитьПараметр("РассчитыватьНесобранныеКомплекты",    РассчитыватьНесобранныеКомплекты);
	Запрос.УстановитьПараметр("ВыгружатьОстаткиВРазрезеОрганизации", ВыгружатьОстаткиВРазрезеОрганизации);
	Запрос.УстановитьПараметр("Организация", 						 Настройки.Организация);
	Запрос.УстановитьПараметр("ПустаяУпаковка", 					 ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	Заменитель = "ИЕРАРХИИ";
	
	ПараметрСклад = Неопределено;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_Ламода_Склады.НаправленияДеятельности КАК ИС_Ламода_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_Ламода_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
	|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_Ламода_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Если ВыборкаНазначения.Количество() = 0 Тогда		
		Назначения = Справочники.Назначения.ПустаяСсылка();	
	Иначе	
		
		Назначения = Новый Массив;
		
		Пока ВыборкаНазначения.Следующий() Цикл	
			Назначения.Добавить(ВыборкаНазначения.Назначение);
		КонецЦикла;
		
	КонецЕсли;

	Запрос.УстановитьПараметр("Назначение", Назначения);	
		
	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ламода_Склады.Ссылка КАК Ссылка,
		|	ИС_Ламода_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
		|	ИС_Ламода_Склады.Склад КАК Склад,
		|	ИС_Ламода_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
		|	ИС_Ламода_Склады.Склад КАК СкладГруппы
		|ИЗ
		|	Справочник.ИС_Ламода_Склады КАК ИС_Ламода_Склады
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ламода_Склады.ГруппаСкладов КАК ИС_Ламода_СкладыГруппаСкладов
		|		ПО ИС_Ламода_Склады.Ссылка = ИС_Ламода_СкладыГруппаСкладов.Ссылка
		|ГДЕ
		|	ИС_Ламода_Склады.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Ссылка";

	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
			
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    ПараметрСклад = Новый Массив;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	ПараметрСклад.Добавить(ВыборкаГруппаСкладов.СкладГруппы);
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Заменитель = "";
			ПараметрСклад = ВыборкаСклад.ОбщаяГруппаСкладов;
		Иначе
			ПараметрСклад = ВыборкаСклад.Склад;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Заменитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Заменитель, "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрСклад) Тогда
		Текст = СтрШаблон("Не заполнено сопоставление склада %1 (%2)", ПараметрСклад, Профиль);
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("Склад1С", ПараметрСклад);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьОстатки(Профиль) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Получение остатков невозможно");
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ПараметрыЗапроса = ПараметрыHTTPЗапросаB2B(Профиль);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ламода_РазмерыНоменклатуры.Ссылка КАК РазмерЛамода,
		|	ИС_Ламода_РазмерыНоменклатуры.seller_sku КАК SellerSKU,
		|	0 КАК Остаток
		|ИЗ
		|	Справочник.ИС_Ламода_РазмерыНоменклатуры КАК ИС_Ламода_РазмерыНоменклатуры
		|ГДЕ
		|	ИС_Ламода_РазмерыНоменклатуры.Профиль = &Профиль
		|	И НЕ ИС_Ламода_РазмерыНоменклатуры.ПометкаУдаления
		|	И НЕ ИС_Ламода_РазмерыНоменклатуры.Код = """"";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивSKU = Результат.ВыгрузитьКолонку("SellerSKU");
	
	КоличествоЭлементов = 25;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивSKU, КоличествоЭлементов);
	
	Для Каждого ЭлементМассива Из РазбитыйМассив Цикл
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("sku", ЭлементМассива);
		
		ОстаткиТоваров = ИС_Ламода_АПИ.ПолучитьОстатки(Профиль, ПараметрыЗапроса, СтруктураПараметров);
		                                                                                       
		Если ОстаткиТоваров = Неопределено Или ОстаткиТоваров.Свойство("stockStates") = Неопределено Тогда
			Возврат Новый ТаблицаЗначений;	
		КонецЕсли;
		
		Для Каждого Товар Из ОстаткиТоваров.stockStates Цикл
			
			НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("SellerSKU", Товар.sku));
			НайденныеСтроки[0].Остаток = Число(Товар.quantity);
			
		КонецЦикла;
		
	КонецЦикла;
                							
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Получение остатков невозможно");
		Возврат;
	КонецЕсли;
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	МассивНастроек = ИС_МП_УправлениеОстатками.МассивПараметровВыгрузкиОстатков();	
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивНастроек);
		
	ИспользоватьПоследниеОстатки = Ложь;
	
	Если Настройки.ИспользоватьПоследниеОстатки <> Неопределено Тогда
		ИспользоватьПоследниеОстатки = Настройки.ИспользоватьПоследниеОстатки;
	КонецЕсли;
		
	Если ТаблицаВыгрузки = Неопределено Тогда		
		ТаблицаВыгрузки = ИС_МП_УправлениеОстатками.СформироватьТаблицуВыгрузки(Профиль, Склад, ПеречислениеМП, Настройки);		
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		СтруктураВыгрузки = Новый Структура;
		СтруктураВыгрузки.Вставить("sku",      Строка.SellerSKU);
		СтруктураВыгрузки.Вставить("quantity", Строка.Остаток);
		
		МассивНоменклатуры.Добавить(СтруктураВыгрузки);
		
	КонецЦикла;
	
	ПараметрыЗапроса = ПараметрыHTTPЗапросаB2B(Профиль);
	
	ПределОшибок     = 10;
	КоличествоОшибок = 0;
	
	БылиОшибкиВыгрузки = Ложь;
	
	Пока Истина Цикл
		
		Если КоличествоОшибок >= ПределОшибок Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("stockStates", МассивНоменклатуры);
		
		Результат = ИС_Ламода_АПИ.ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, СтруктураПараметров);
			
		Если Результат = Неопределено Тогда
			
			КоличествоОшибок = КоличествоОшибок + 1;
			БылиОшибкиВыгрузки = Истина;
			Продолжить;
			
		Иначе	
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ИспользоватьПоследниеОстатки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не БылиОшибкиВыгрузки Тогда 
	
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			
			ИС_МП_УправлениеОстатками.ЗаписатьПоследнийВыгруженныйОстаток(Профиль, 
				ПеречислениеМП, Склад, Строка.РазмерЛамода, Строка.Остаток);
				
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьСтруктуруПараметровОстатков() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИспользоватьПоследниеОстатки",     Ложь);
	Результат.Вставить("ИспользоватьФиксированныйОстаток", Ложь);
	Результат.Вставить("ФиксированныйОстаток",             0);
	Результат.Вставить("РежимСокрытияОстатков",            Ложь);

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьСкладПоУмолчанию(Профиль) Экспорт

	Результат = Справочники.ИС_Ламода_Склады.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ИС_Ламода_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Ламода_Склады КАК ИС_Ламода_Склады
	|ГДЕ
	|	ИС_Ламода_Склады.Профиль = &Профиль
	|	И НЕ ИС_Ламода_Склады.ПометкаУдаления";

	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область Цены

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьТекстЗапросаЦен() Экспорт 
	
	Текст = 
		"ВЫБРАТЬ
		|	ИС_Ламода_РазмерыНоменклатуры.Ссылка КАК ПолеСопоставления
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.ИС_Ламода_РазмерыНоменклатуры КАК ИС_Ламода_РазмерыНоменклатуры
		|ГДЕ
		|	ИС_Ламода_РазмерыНоменклатуры.Профиль = &Профиль
		|	И НЕ ИС_Ламода_РазмерыНоменклатуры.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_МП_РучныеЦены.КарточкаМП КАК ПолеСопоставления,
		|	ИС_МП_РучныеЦены.Цена КАК Цена,
		|	0 КАК ЦенаСоСкидкой
		|ПОМЕСТИТЬ ВТ_РучныеЦеныОбъединение
		|ИЗ
		|	РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦены
		|ГДЕ
		|	ИС_МП_РучныеЦены.Профиль = &Профиль
		|	И ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс
		|	И ИС_МП_РучныеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИС_МП_РучныеЦеныСоСкидкой.КарточкаМП,
		|	0,
		|	ИС_МП_РучныеЦеныСоСкидкой.Цена
		|ИЗ
		|	РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦеныСоСкидкой
		|ГДЕ
		|	ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль
		|	И ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
		|	И ИС_МП_РучныеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_МП_ПоследниеЦены.КарточкаМП КАК ПолеСопоставления,
		|	ИС_МП_ПоследниеЦены.Цена КАК Цена,
		|	0 КАК ЦенаСоСкидкой
		|ПОМЕСТИТЬ ВТ_ПоследниеЦеныОбъединение
		|ИЗ
		|	РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦены
		|ГДЕ
		|	ИС_МП_ПоследниеЦены.Профиль = &Профиль
		|	И ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс
		|	И ИС_МП_ПоследниеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИС_МП_ПоследниеЦеныСоСкидкой.КарточкаМП,
		|	0,
		|	ИС_МП_ПоследниеЦеныСоСкидкой.Цена
		|ИЗ
		|	РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦеныСоСкидкой
		|ГДЕ
		|	ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль
		|	И ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
		|	И ИС_МП_ПоследниеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
		|	СУММА(ВТ_РучныеЦеныОбъединение.Цена) КАК Цена,
		|	СУММА(ВТ_РучныеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
		|ПОМЕСТИТЬ ВТ_РучныеЦены
		|ИЗ
		|	ВТ_РучныеЦеныОбъединение КАК ВТ_РучныеЦеныОбъединение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
		|	СУММА(ВТ_ПоследниеЦеныОбъединение.Цена) КАК Цена,
		|	СУММА(ВТ_ПоследниеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
		|ПОМЕСТИТЬ ВТ_ПоследниеЦены
		|ИЗ
		|	ВТ_ПоследниеЦеныОбъединение КАК ВТ_ПоследниеЦеныОбъединение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_Номенклатура.ПолеСопоставления.Владелец КАК НоменклатураЛамода,
		|	ВТ_Номенклатура.ПолеСопоставления.seller_sku КАК SellerSKU,
		|	ВТ_Номенклатура.ПолеСопоставления.Код КАК LamodaSKU,
		|	ИС_Ламода_СоответствиеТоваров.Номенклатура КАК Номенклатура,
		|	ИС_Ламода_СоответствиеТоваров.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК ХарактеристикаЦО,
		|	ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
		|	ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Упаковка, &ПустаяУпаковка) КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ИС_Ламода_СоответствиеТоваров.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ИС_Ламода_СоответствиеТоваров.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ИС_Ламода_СоответствиеТоваров.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковки,
		|	НЕ ИС_Ламода_СоответствиеТоваров.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
		|	ВТ_РучныеЦены.Цена КАК РучнаяЦена,
		|	НЕ ВТ_РучныеЦены.Цена ЕСТЬ NULL КАК ЕстьРучнаяЦена,
		|	ВТ_РучныеЦены.ЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
		|	НЕ ВТ_РучныеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьРучнаяЦенаСоСкидкой,
		|	ЕСТЬNULL(ВТ_ПоследниеЦены.Цена, 0) КАК ПоследняяВыгруженнаяЦена,
		|	НЕ ВТ_ПоследниеЦены.Цена ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦена,
		|	ЕСТЬNULL(ВТ_ПоследниеЦены.ЦенаСоСкидкой, 0) КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
		|	НЕ ВТ_ПоследниеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой
		|ПОМЕСТИТЬ ВТ_Сопоставление
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ламода_СоответствиеТоваров КАК ИС_Ламода_СоответствиеТоваров
		|		ПО (ИС_Ламода_СоответствиеТоваров.Профиль = &Профиль)
		|			И (ИС_Ламода_СоответствиеТоваров.РазмерЛамода = ВТ_Номенклатура.ПолеСопоставления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РучныеЦены КАК ВТ_РучныеЦены
		|		ПО (ВТ_РучныеЦены.ПолеСопоставления = ВТ_Номенклатура.ПолеСопоставления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦены КАК ВТ_ПоследниеЦены
		|		ПО (ВТ_ПоследниеЦены.ПолеСопоставления = ВТ_Номенклатура.ПолеСопоставления)";	
	
	Текст = Текст + ";";
	
	Текст = Текст + ИС_МП_УправлениеЦенами.ТекстЗапросаЦен();
	
	Текст = Текст +	
	
		"ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК РазмерНоменклатурыЛамода,
		|	ВТ_Сопоставление.НоменклатураЛамода КАК НоменклатураЛамода,
		|	ВТ_Сопоставление.SellerSKU КАК SellerSKU,
		|	ВТ_Сопоставление.LamodaSKU КАК LamodaSKU,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВТ_Сопоставление.Упаковка КАК Упаковка,
		|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
		|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
		|	ВТ_Сопоставление.РучнаяЦена КАК РучнаяЦена,
		|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
		|	ВТ_Сопоставление.ЕстьРучнаяЦена КАК ЕстьРучнаяЦена,
		|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой КАК ЕстьРучнаяЦенаСоСкидкой,
		|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена КАК ПоследняяВыгруженнаяЦена,
		|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
		|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена КАК ЕстьПоследняяВыгруженнаяЦена,
		|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
		|	ВТ_Цены.Цена КАК Цена,
		|	ВТ_Цены.ЦенаСоСкидкой КАК ЦенаСоСкидкой
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Цены.ПолеСопоставления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ,
		|	ВТ_Сопоставление.РучнаяЦена УБЫВ";
	
	Возврат Текст;
		
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура УстановитьПараметрыЗапросаЦен(Запрос, Профиль) Экспорт
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	МассивПараметров = МассивНастроекЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
		
	Запрос.УстановитьПараметр("Маркетплейс"		  , Маркетплейс);
	Запрос.УстановитьПараметр("ВидЦены"			  , СтруктураЦен.ВидЦены); 
	Запрос.УстановитьПараметр("ВидЦеныСоСкидкой"  , СтруктураЦен.ВидЦеныСоСкидкой);
	Запрос.УстановитьПараметр("ВидЦеныМинимальный", Справочники.ВидыЦен.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидЦеныFBO"		  , Справочники.ВидыЦен.ПустаяСсылка());
	Запрос.УстановитьПараметр("Профиль"			  , Профиль); 
	Запрос.УстановитьПараметр("ПустаяУпаковка"	  , ИС_MP_СерверЛокализация.ПустаяСсылкаУпаковка());
		
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьСтруктуруПараметровЦен() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидЦены",                   Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("ВидЦеныСоСкидкой",          Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("РежимОкругленияЦен",        0);
	Результат.Вставить("ИспользоватьПоследниеЦены", Ложь); 

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура ВыгрузитьЦены(Профиль, ТаблицаВыгрузки = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Выгрузка цен невозможна");
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	МассивПараметров = МассивНастроекЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	РежимОкругленияЦен        = СтруктураЦен.РежимОкругленияЦен;
	ИспользоватьПоследниеЦены = СтруктураЦен.ИспользоватьПоследниеЦены;
	
	Если ТаблицаВыгрузки = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ПолучитьТекстЗапросаЦен(); 
		
		УстановитьПараметрыЗапросаЦен(Запрос, Профиль);                                                       
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТаблицаВыгрузки = Новый ТаблицаЗначений;	
		
		ИС_МП_УправлениеЦенами.ЗаполнитьКолонкиТаблицыВыгрузкиЦен(Маркетплейс, ТаблицаВыгрузки);
		
		МассивПолей = ИС_МП_УправлениеЦенами.ПолучитьПоляДляВыгрузки(Маркетплейс);
		
		Пока Выборка.Следующий() Цикл
		
			Если Не Выборка.ЕстьСопоставление И Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
			Для Каждого Элемент Из МассивПолей Цикл
				НоваяСтрока[Элемент] = Выборка[Элемент];
			КонецЦикла;
			
			Если Выборка.ЕстьРучнаяЦена Тогда
				Цена = Выборка.РучнаяЦена;
			Иначе  
				Цена = Выборка.Цена;	
			КонецЕсли;
			
			Цена = Окр(Цена, 0, РежимОкругленияЦен);
			
			НоваяСтрока.Цена = Цена;
			
			Если Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				ЦенаСоСкидкой = Выборка.РучнаяЦенаСоСкидкой;
			Иначе
				ЦенаСоСкидкой = Выборка.ЦенаСоСкидкой;	
			КонецЕсли;
				
			ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
			
			НоваяСтрока.ЦенаСоСкидкой = ЦенаСоСкидкой;
			
			Если НоваяСтрока.Цена = 0 И НоваяСтрока.ЦенаСоСкидкой = 0 Тогда 
				ТаблицаВыгрузки.Удалить(НоваяСтрока);
			КонецЕсли;
			
			Если Не ИспользоватьПоследниеЦены Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
			
				Если Не ИС_МП_УправлениеЦенами.ПроверитьПоследниеЦены(Маркетплейс, Выборка, НоваяСтрока) Тогда
					ТаблицаВыгрузки.Удалить(НоваяСтрока);
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ПараметрыHTTPЗапросаSeller(Профиль);
	
	ПределОшибок     = 10;
	КоличествоОшибок = 0;
	
	СтруктураПараметров = ИС_Ламода_АПИ.СтруктураПараметровЗапросаОбновленияЦен();
	
	ВыгруженныеСтроки = Новый Массив;
	
	Пока Истина Цикл
		
		Если КоличествоОшибок >= ПределОшибок Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			
			СтруктураПараметров.seller_sku = Строка.SellerSKU;
			СтруктураПараметров.price      = Формат(Строка.Цена, "ЧН=0; ЧГ=0");
			СтруктураПараметров.sale_price = Формат(Строка.ЦенаСоСкидкой, "ЧН=0; ЧГ=0");
			
			Результат = ИС_Ламода_АПИ.ОбновитьЦены(Профиль, ПараметрыЗапроса, СтруктураПараметров);
			
			Если Не Результат = Неопределено Тогда
					
				ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
					Маркетплейс, Строка.РазмерЛамода, Строка.Цена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);
				
				ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
					Маркетплейс, Строка.РазмерЛамода, Строка.ЦенаСоСкидкой, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой);
					
				ВыгруженныеСтроки.Добавить(Строка);	
					
			Иначе		
				
				КоличествоОшибок = КоличествоОшибок + 1;
				
				Для Каждого ВыгруженнаяСтрока из ВыгруженныеСтроки Цикл
					ТаблицаВыгрузки.Удалить(ВыгруженнаяСтрока);
				КонецЦикла;
				
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120	

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьЦеныFBS(Профиль) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Получение цен невозможно");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ПараметрыHTTPЗапросаSeller(Профиль);
	
	ПределОшибок     = 10;
	КоличествоОшибок = 0;	
	
	ТаблицаЦен = ПолучитьСтруктуруТаблицыПолученияЦен();
	
	Пока Истина Цикл
		
		Если КоличествоОшибок >= ПределОшибок Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = ИС_Ламода_АПИ.ПолучитьЦены(Профиль, ПараметрыЗапроса);
		
		Если Результат = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
		
		МассивНоменклатуры = Результат["nomenclatures"];
		
		Если МассивНоменклатуры.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого Элемент Из МассивНоменклатуры Цикл
			
			НоваяСтрока = ТаблицаЦен.Добавить();
			
			НоваяСтрока.lamoda_sku = Элемент.lamodaSku;
			
			МассивЦенНоменклатуры = Элемент._embedded.sellValues; 
			
			Для Каждого ЦенаСтраны Из МассивЦенНоменклатуры Цикл
				
				Если ЦенаСтраны.country = "RU" Тогда
					
					НоваяСтрока.Цена          = ЦенаСтраны.price;
					НоваяСтрока.ЦенаСоСкидкой = ЦенаСтраны.salePrice;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;	
		
		Прервать;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЦен.lamoda_sku КАК lamoda_sku,
		|	ТаблицаЦен.Цена КАК Цена,
		|	ТаблицаЦен.ЦенаСоСкидкой КАК ЦенаСоСкидкой
		|ПОМЕСТИТЬ ВТ_ТаблицаЦен
		|ИЗ
		|	&ТаблицаЦен КАК ТаблицаЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_Ламода_РазмерыНоменклатуры.Ссылка КАК РазмерЛамода,
		|	ВТ_ТаблицаЦен.lamoda_sku КАК lamoda_sku,
		|	ВТ_ТаблицаЦен.Цена КАК Цена,
		|	ВТ_ТаблицаЦен.ЦенаСоСкидкой КАК ЦенаСоСкидкой
		|ИЗ
		|	Справочник.ИС_Ламода_РазмерыНоменклатуры КАК ИС_Ламода_РазмерыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЦен КАК ВТ_ТаблицаЦен
		|		ПО ИС_Ламода_РазмерыНоменклатуры.Код = ВТ_ТаблицаЦен.lamoda_sku
		|ГДЕ
		|	НЕ ИС_Ламода_РазмерыНоменклатуры.ПометкаУдаления
		|	И ИС_Ламода_РазмерыНоменклатуры.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль",    Профиль);
	Запрос.УстановитьПараметр("ТаблицаЦен", ТаблицаЦен);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ИмяСобытия(Имя)
	
	Возврат СтрШаблон("ИС.МП.ИС_Ламода_Сервер.%1", Имя);
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПараметрыHTTPЗапросаB2B(Профиль)
	
	НастройкиСоединения = ИС_Ламода_СерверПовтИсп.НастройкиСоединения(Профиль);  
	
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.ClientId) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнено ""client_id"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НастройкиСоединения.ClientSecret) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнено ""client_secret"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.АдресСервисаB2B) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнен ""Адрес cервиса B2B"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.ПортB2B) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнен ""Порт B2B"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.HTTPSB2B) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнено ""Защищенное соединение B2B"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли;
	
	ТекстОшибки = СокрП(ТекстОшибки); 

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
	ПараметрыЗапроса.Сервер               = НастройкиСоединения.АдресСервисаB2B;
	ПараметрыЗапроса.Порт                 = НастройкиСоединения.ПортB2B;
	ПараметрыЗапроса.ЗащищенноеСоединение = НастройкиСоединения.HTTPSB2B;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.AccessTokenB2BИстекает) 
		Или НастройкиСоединения.AccessTokenB2BИстекает <= ТекущаяДатаСеанса() Тогда
			
		Токен = ПолучитьТокенB2B(Профиль, ПараметрыЗапроса, НастройкиСоединения);
		
		Если Токен = Неопределено Тогда
			ВызватьИсключение("Не удалось обновить токены доступа к Lamoda B2B");
		КонецЕсли;
		
	Иначе
		Токен = НастройкиСоединения.AccessTokenB2B;
	КонецЕсли;
	
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	
	Возврат ПараметрыЗапроса;

КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПараметрыHTTPЗапросаSeller(Профиль)
	
	НастройкиСоединения = ИС_Ламода_СерверПовтИсп.НастройкиСоединения(Профиль);  
	
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.ClientId) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнено ""client_id"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НастройкиСоединения.ClientSecret) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнено ""client_secret"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.АдресСервисаSeller) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнен ""Адрес cервиса Seller"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.ПортSeller) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнен ""Порт Seller"", проверьте настройки авторизации" + Символы.ПС;
	КонецЕсли; 
	
	ТекстОшибки = СокрП(ТекстОшибки); 

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
	ПараметрыЗапроса.Сервер               = НастройкиСоединения.АдресСервисаSeller;
	ПараметрыЗапроса.Порт                 = НастройкиСоединения.ПортSeller;
	ПараметрыЗапроса.ЗащищенноеСоединение = НастройкиСоединения.HTTPSSeller;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.AccessTokenSellerИстекает) 
		Или НастройкиСоединения.AccessTokenSellerИстекает <= ТекущаяДатаСеанса() Тогда
			
		Токен = ПолучитьТокенSeller(Профиль, ПараметрыЗапроса, НастройкиСоединения);
		
		Если Токен = Неопределено Тогда
			ВызватьИсключение("Не удалось обновить токены доступа к Lamoda Seller");
		КонецЕсли;
		
	Иначе
		Токен = НастройкиСоединения.AccessTokenSeller;
	КонецЕсли;
	
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	
	Возврат ПараметрыЗапроса;

КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьСтруктуруТаблицыПолученияЦен()

	ТаблицаЦен = Новый ТаблицаЗначений;
	
	ТаблицаЦен.Колонки.Добавить("lamoda_sku");
	ТаблицаЦен.Колонки.Добавить("Цена");
	ТаблицаЦен.Колонки.Добавить("ЦенаСоСкидкой");
	
	Возврат ТаблицаЦен;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти
